app/Controllers/Admin/Appointments.php

SELECT `id`, `first_name`, `middle_name`, `last_name`
FROM `patients`
ORDER BY `last_name` ASC, `first_name` ASC
SELECT `ds`.`id`, `ds`.`shift_name`, `ds`.`start_time`, `ds`.`end_time`, `ds`.`valid_from`, `ds`.`valid_to`, `d`.`full_name`
FROM `doctor_schedules` `ds`
JOIN `doctors` `d` ON `d`.`id` = `ds`.`doctor_id`
ORDER BY `d`.`full_name` ASC, `ds`.`shift_name` ASC
---
    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (! $this->hasRole('admin')) {
            return redirect()->to(base_url('dashboard'));
        }

        $db = db_connect();

        // Patients for select
        $patients = $db->table('patients')
            ->select('id, first_name, middle_name, last_name')
            ->orderBy('last_name', 'ASC')
            ->orderBy('first_name', 'ASC')
            ->get()->getResultArray();

        // Doctor schedules for select
        $schedules = $db->table('doctor_schedules ds')
            ->select('ds.id, ds.shift_name, ds.start_time, ds.end_time, ds.valid_from, ds.valid_to, d.full_name')
            ->join('doctors d', 'd.id = ds.doctor_id')
            ->orderBy('d.full_name', 'ASC')
            ->orderBy('ds.shift_name', 'ASC')
            ->get()->getResultArray();

SELECT `a`.`id`, `a`.`appointment_date`, `a`.`schedule_type`, `a`.`status`, `p`.`first_name`, `p`.`middle_name`, `p`.`last_name`, `d`.`full_name` AS `doctor_name`
FROM `appointments` `a`
JOIN `patients` `p` ON `p`.`id` = `a`.`patient_id`
JOIN `doctor_schedules` `ds` ON `ds`.`id` = `a`.`doctor_schedule_id`
JOIN `doctors` `d` ON `d`.`id` = `ds`.`doctor_id`
WHERE `a`.`appointment_date` >= '2025-12-14'
AND `a`.`appointment_date` <= '2026-12-14'
ORDER BY `a`.`appointment_date` ASC
---
        $today = date('Y-m-d');
        $oneYearLater = date('Y-m-d', strtotime('+1 year'));

        $appointments = $db->table('appointments a')
            ->select('a.id, a.appointment_date, a.schedule_type, a.status, p.first_name, p.middle_name, p.last_name, d.full_name AS doctor_name')
            ->join('patients p', 'p.id = a.patient_id')
            ->join('doctor_schedules ds', 'ds.id = a.doctor_schedule_id')
            ->join('doctors d', 'd.id = ds.doctor_id')
            ->where('a.appointment_date >=', $today)
            ->where('a.appointment_date <=', $oneYearLater)
            ->orderBy('a.appointment_date', 'ASC')
            ->get()->getResultArray();