app/Controllers/Admin/Scheduling.php

SELECT `id`, `full_name`, `specialization`, `status`
FROM `doctors`
WHERE `status` = 'active'
ORDER BY `full_name` ASC
---
    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (! $this->hasRole('admin')) {
            return redirect()->to(base_url('dashboard'));
        }

        $db = db_connect();

        // Doctors for select
        $doctors = $db->table('doctors')
            ->select('id, full_name, specialization, status')
            ->where('status', 'active')
            ->orderBy('full_name', 'ASC')
            ->get()->getResultArray();