app/Controllers/Admin/UserAccess.php

    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (! $this->hasRole('admin')) {
            return redirect()->to(base_url('dashboard'));
        }

        $db = db_connect();
        $roles = $db->table('roles')
            ->select('id, name, display_name')
            ->where('is_active', 1)
            ->orderBy('level', 'DESC')
            ->get()->getResultArray();

        // Get all users with their roles
        $users = $db->table('users u')
            ->select('u.id, u.username, u.email, u.first_name, u.middle_name, u.last_name, u.address, u.status, u.created_at, r.name as role_name, r.display_name as role_display_name')
            ->join('roles r', 'r.id = u.role_id', 'left')
            ->orderBy('u.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`, `display_name`
FROM `roles`
WHERE `is_active` = 1
ORDER BY `level` DESC
SELECT `u`.`id`, `u`.`username`, `u`.`email`, `u`.`first_name`, `u`.`middle_name`, `u`.`last_name`, `u`.`address`, `u`.`status`, `u`.`created_at`, `r`.`name` as `role_name`, `r`.`display_name` as `role_display_name`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
ORDER BY `u`.`created_at` DESC

        $db = db_connect();

        // Check for existing email
        $exists = $db->table('users')->where('email', $email)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'erin@gmail.com'

        ];

        $db->table('users')->insert($userData);
        $userId = $db->insertID();
---
INSERT INTO `users` (`username`, `email`, `password`, `first_name`, `middle_name`, `last_name`, `address`, `role_id`, `status`, `created_at`, `updated_at`) VALUES ('erin', 'erin@gmail.com', '$2y$10$4uRK8VEInYFS2dkYfp/qaO1BTKHseYEJaqNKkVDCUpssPmrc3agV6', 'Erin', 'Ella', 'Buhisan', 'labangal, gsc', 3, 'active', '2025-12-15 18:32:05', '2025-12-15 18:32:05')

                'updated_at'     => date('Y-m-d H:i:s'),
            ];

            $db->table('doctors')->insert($doctorData);
---
INSERT INTO `doctors` (`user_id`, `full_name`, `specialization`, `license_number`, `status`, `created_at`, `updated_at`) VALUES (16, 'Erin Ella Buhisan', NULL, 'DR-522647515', 'active', '2025-12-15 18:32:05', '2025-12-15 18:32:05')