app/Controllers/Patient/Registration.php

    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        $db = db_connect();
        // Basic patient list with inferred visit type (inpatient if admission record exists)
        $builder = $db->table('patients p')
            ->select('p.id, p.first_name, p.middle_name, p.last_name, p.date_of_birth, p.gender, a.id AS admission_id')
            ->join('admissions a', 'a.patient_id = p.id', 'left')
            ->orderBy('p.id', 'DESC');

        $patients = $builder->get()->getResultArray();
---
SELECT `p`.`id`, `p`.`first_name`, `p`.`middle_name`, `p`.`last_name`, `p`.`date_of_birth`, `p`.`gender`, `a`.`id` AS `admission_id`
FROM `patients` `p`
LEFT JOIN `admissions` `a` ON `a`.`patient_id` = `p`.`id`
ORDER BY `p`.`id` DESC