app/Controllers/Pharmacy/Dashboard.php

SELECT `id`, `medicine_name`, `category`, `stock_quantity`, `unit_price`, `unit`, `status`, `created_at`, `updated_at`
FROM `medicines`
WHERE `status` = 'active'
ORDER BY `medicine_name` ASC
---
    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('pharmacist')) {
            $this->session->setFlashdata('error', 'You do not have permission to access this page.');
            return redirect()->to(base_url('dashboard'));
        }

        $db = db_connect();

        // Get all medicines for inventory section
        $medicines = $db->table('medicines')
            ->select('id, medicine_name, category, stock_quantity, unit_price, unit, status, created_at, updated_at')
            ->where('status', 'active')
            ->orderBy('medicine_name', 'ASC')
            ->get()
            ->getResultArray();

SELECT `p`.`id`, `p`.`patient_id`, `p`.`doctor_id`, `p`.`medicine_id`, `p`.`prescribed_quantity`, `p`.`dispensed_quantity`, `p`.`status`, `p`.`prescription_date`, `p`.`notes`, `p`.`created_at`, `pt`.`first_name` as `patient_first_name`, `pt`.`middle_name` as `patient_middle_name`, `pt`.`last_name` as `patient_last_name`, `d`.`full_name` as `doctor_name`, `d`.`specialization`, `m`.`medicine_name`, `m`.`category` as `medicine_category`, `m`.`stock_quantity` as `medicine_stock`, `m`.`unit` as `medicine_unit`, `m`.`unit_price`
FROM `prescriptions` `p`
LEFT JOIN `patients` `pt` ON `pt`.`id` = `p`.`patient_id`
LEFT JOIN `doctors` `d` ON `d`.`id` = `p`.`doctor_id`
LEFT JOIN `medicines` `m` ON `m`.`id` = `p`.`medicine_id`
ORDER BY `p`.`created_at` DESC
---
        $totalInventoryValue = array_sum(array_column($medicines, 'total_value'));

        // Get all prescriptions with related data
        $prescriptions = $db->table('prescriptions p')
            ->select('p.id, p.patient_id, p.doctor_id, p.medicine_id, p.prescribed_quantity, p.dispensed_quantity, p.status, p.prescription_date, p.notes, p.created_at,
                     pt.first_name as patient_first_name, pt.middle_name as patient_middle_name, pt.last_name as patient_last_name,
                     d.full_name as doctor_name, d.specialization,
                     m.medicine_name, m.category as medicine_category, m.stock_quantity as medicine_stock, m.unit as medicine_unit, m.unit_price')
            ->join('patients pt', 'pt.id = p.patient_id', 'left')
            ->join('doctors d', 'd.id = p.doctor_id', 'left')
            ->join('medicines m', 'm.id = p.medicine_id', 'left')
            ->orderBy('p.created_at', 'DESC')
            ->get()
            ->getResultArray();