app/Controllers/Auth.php

        $roleModel = new RoleModel();

        // Find user by email
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1

        $role = null;
        $roleName = null;
        if (!empty($user['role_id'])) {
            $role = $roleModel->find($user['role_id']);
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = '1'