app/Models/SettingsModel.php

    public function getSetting(string $key, $default = null)
    {
        $setting = $this->where('setting_key', $key)->first();
---
SELECT *
FROM `settings`
WHERE `setting_key` = 'hospital_name'
 LIMIT 1

    public function getSettingsByGroup(string $group = 'general'): array
    {
        $settings = $this->where('setting_group', $group)->findAll();
---
SELECT *
FROM `settings`
WHERE `setting_group` = 'general'

    public function saveSettings(array $settings, string $group = 'general'): bool
    {
        log_message('debug', 'saveSettings called with group: ' . $group . ', settings: ' . json_encode($settings));

        try {
            $allSuccess = true;
            $savedCount = 0;

            foreach ($settings as $key => $value) {
                $existing = $this->where('setting_key', $key)->first();

                $data = [
                    'setting_key' => $key,
                    'setting_value' => is_array($value) ? json_encode($value) : (string)$value,
                    'setting_group' => $group,
                ];

                log_message('debug', "Processing setting: {$key} = " . (string)$value);

                if ($existing) {
                    // Always update to ensure timestamps are updated
                    $result = $this->update($existing['id'], $data);
---
SELECT *
FROM `settings`
WHERE `setting_key` = 'hospital_name'
 LIMIT 1
UPDATE `settings` SET `setting_key` = 'hospital_name', `setting_value` = 'JEZ HOSPITAL(JACOB ERIN ZYF)', `setting_group` = 'general', `updated_at` = '2025-12-16 02:38:29'
WHERE `settings`.`id` IN ('1')