app/Controllers/It/UserManagement.php

SELECT `u`.`id`, `u`.`username`, `u`.`email`, `u`.`first_name`, `u`.`middle_name`, `u`.`last_name`, `u`.`address`, `u`.`status`, `u`.`created_at`, `u`.`updated_at`, `r`.`name` as `role_name`, `r`.`display_name` as `role_display_name`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
ORDER BY `u`.`created_at` DESC
---
    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!($this->hasRole('it_staff') || $this->hasRole('it'))) {
            return redirect()->to(site_url('dashboard'));
        }

        $db = db_connect();

        // Get all users with their roles
        $users = $db->table('users u')
            ->select('u.id, u.username, u.email, u.first_name, u.middle_name, u.last_name, u.address, u.status, u.created_at, u.updated_at,
                r.name as role_name, r.display_name as role_display_name')
            ->join('roles r', 'r.id = u.role_id', 'left')
            ->orderBy('u.created_at', 'DESC')
            ->get()
            ->getResultArray();