app/Controllers/Doctor/LabResults.php

SELECT *
FROM `doctors`
WHERE `user_id` = '14'
---
    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('doctor')) {
            return redirect()->to(site_url('dashboard'));
        }

        $userId = session()->get('user_id');
        $db = db_connect();

        // Get doctor ID from doctors table
        $doctor = $db->table('doctors')
            ->where('user_id', $userId)
            ->get()
            ->getRowArray();

SELECT `id`, `first_name`, `middle_name`, `last_name`
FROM `patients`
ORDER BY `last_name` ASC
---
        $inProgressTests = count(array_filter($labTests, fn($t) => ($t['status'] ?? 'pending') === 'in_progress'));

        // Get patients for dropdown
        $patients = $db->table('patients')
            ->select('id, first_name, middle_name, last_name')
            ->orderBy('last_name', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `doctors`
WHERE `user_id` = '14'
---
    public function store()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('doctor')) {
            $this->session->setFlashdata('error', 'You do not have permission to perform this action.');
            return redirect()->to(site_url('doctor/lab-results'));
        }

        $userId = session()->get('user_id');
        $db = db_connect();

        // Get doctor ID from doctors table
        $doctor = $db->table('doctors')
            ->where('user_id', $userId)
            ->get()
            ->getRowArray();

INSERT INTO `lab_tests` (`patient_id`, `doctor_id`, `test_type`, `test_name`, `notes`, `status`, `created_at`) VALUES (1, '2', 'Blood Test', 'Hormone Panel', '', 'pending', '2025-12-15 18:30:53')
---
        }

        try {
            $db->table('lab_tests')->insert($data);