app/Controllers/Doctor/Prescriptions.php

SELECT *
FROM `doctors`
WHERE `user_id` = '14'
---
    public function store()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('doctor')) {
            $this->session->setFlashdata('error', 'You do not have permission to perform this action.');
            return redirect()->to(site_url('doctor/prescriptions'));
        }

        $userId = session()->get('user_id');
        $db = db_connect();

        // Get doctor ID
        $doctor = $db->table('doctors')
            ->where('user_id', $userId)
            ->get()
            ->getRowArray();

INSERT INTO `prescriptions` (`patient_id`, `doctor_id`, `medicine_id`, `prescribed_quantity`, `prescription_date`, `notes`, `status`, `created_at`) VALUES (1, '2', 8, 5, '2025-12-15', '', 'pending', '2025-12-15 18:31:12')
---
        }

        try {
            $db->table('prescriptions')->insert($data);