app/Controllers/Accounts/Billing.php

    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('accountant')) {
            return redirect()->to(site_url('dashboard'));
        }

        $db = db_connect();

        // Get all bills with patient information and payments
        $allBills = $db->table('bills b')
            ->select('b.*,
                COALESCE(b.invoice_number, CONCAT("INV-", YEAR(b.created_at), "-", LPAD(b.id, 4, "0"))) as invoice_number,
                CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name,
                p.id as patient_id,
                COALESCE(SUM(pay.amount), 0) as paid_amount,
                (b.total_amount - COALESCE(SUM(pay.amount), 0)) as remaining_amount,
                a.id as admission_id', false)
            ->join('patients p', 'p.id = b.patient_id', 'left')
            ->join('payments pay', 'pay.bill_id = b.id', 'left')
            ->join('admissions a', 'a.patient_id = p.id', 'left')
            ->groupBy('b.id')
            ->orderBy('b.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT b.*, 
                COALESCE(b.invoice_number, CONCAT("INV-", YEAR(b.created_at), "-", LPAD(b.id, 4, "0"))) as invoice_number,
                CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name,
                p.id as patient_id,
                COALESCE(SUM(pay.amount), 0) as paid_amount,
                (b.total_amount - COALESCE(SUM(pay.amount), 0)) as remaining_amount,
                a.id as admission_id
FROM `bills` `b`
LEFT JOIN `patients` `p` ON `p`.`id` = `b`.`patient_id`
LEFT JOIN `payments` `pay` ON `pay`.`bill_id` = `b`.`id`
LEFT JOIN `admissions` `a` ON `a`.`patient_id` = `p`.`id`
GROUP BY `b`.`id`
ORDER BY `b`.`created_at` DESC

        $totalPaid = array_sum(array_column($bills, 'paid_amount'));

        // Get all payments for transaction history
        $payments = $db->table('payments pay')
            ->select('pay.*, b.id as bill_id, b.bill_type,
                CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name,
                COALESCE(pay.payment_date, DATE(pay.created_at)) as display_date')
            ->join('bills b', 'b.id = pay.bill_id', 'left')
            ->join('patients p', 'p.id = b.patient_id', 'left')
            ->orderBy('COALESCE(pay.payment_date, DATE(pay.created_at))', 'DESC', false)
            ->orderBy('pay.created_at', 'DESC')
            ->limit(50)
            ->get()
            ->getResultArray();

        // Get all patients for bill creation dropdown
        $patients = $db->table('patients p')
            ->select('p.id, CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name')
            ->orderBy('p.last_name', 'ASC')
            ->orderBy('p.first_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `pay`.*, `b`.`id` as `bill_id`, `b`.`bill_type`, CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name, COALESCE(pay.payment_date, DATE(pay.created_at)) as display_date
FROM `payments` `pay`
LEFT JOIN `bills` `b` ON `b`.`id` = `pay`.`bill_id`
LEFT JOIN `patients` `p` ON `p`.`id` = `b`.`patient_id`
ORDER BY COALESCE(pay.payment_date, DATE(pay.created_at)) DESC, `pay`.`created_at` DESC
 LIMIT 50
SELECT `p`.`id`, CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name
FROM `patients` `p`
ORDER BY `p`.`last_name` ASC, `p`.`first_name` ASC

    public function store()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('accountant')) {
            return redirect()->to(site_url('dashboard'));
        }

        $request = $this->request;
        $db = db_connect();

        $patientId = (int) $request->getPost('patient_id');
        $billType = trim($request->getPost('bill_type') ?? '');
        $totalAmount = floatval($request->getPost('total_amount') ?? 0);
        $description = trim($request->getPost('description') ?? '');

        if (!$patientId || !$billType || $totalAmount <= 0) {
            session()->setFlashdata('error', 'Patient, bill type, and amount are required.');
            return redirect()->to(site_url('accounts/billing'));
        }

        // Generate invoice number: INV-YYYY-NNNN
        $year = date('Y');
        $lastInvoice = $db->table('bills')
            ->like('invoice_number', "INV-{$year}-", 'after')
            ->orderBy('invoice_number', 'DESC')
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `bills`
WHERE `invoice_number` LIKE 'INV-2025-%' ESCAPE '!'
ORDER BY `invoice_number` DESC
 LIMIT 1

            'updated_at' => date('Y-m-d H:i:s'),
        ];

        $db->table('bills')->insert($data);
---
INSERT INTO `bills` (`patient_id`, `invoice_number`, `bill_type`, `total_amount`, `description`, `status`, `created_at`, `updated_at`) VALUES (1, 'INV-2025-0004', 'Pharmacy', 75, NULL, 'pending', '2025-12-15 17:31:34', '2025-12-15 17:31:34')

    public function getPatientBills($patientId)
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);
        }

        if (!$this->hasRole('accountant')) {
            return $this->response->setJSON(['error' => 'Forbidden'])->setStatusCode(403);
        }

        $db = db_connect();

        // Get all pending bills for this patient
        $bills = $db->table('bills b')
            ->select('b.*,
                COALESCE(b.invoice_number, CONCAT("INV-", YEAR(b.created_at), "-", LPAD(b.id, 4, "0"))) as invoice_number,
                COALESCE(SUM(pay.amount), 0) as paid_amount,
                (b.total_amount - COALESCE(SUM(pay.amount), 0)) as remaining_amount', false)
            ->join('payments pay', 'pay.bill_id = b.id', 'left')
            ->where('b.patient_id', $patientId)
            ->groupBy('b.id')
            ->orderBy('b.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT b.*, 
                COALESCE(b.invoice_number, CONCAT("INV-", YEAR(b.created_at), "-", LPAD(b.id, 4, "0"))) as invoice_number,
                COALESCE(SUM(pay.amount), 0) as paid_amount,
                (b.total_amount - COALESCE(SUM(pay.amount), 0)) as remaining_amount
FROM `bills` `b`
LEFT JOIN `payments` `pay` ON `pay`.`bill_id` = `b`.`id`
WHERE `b`.`patient_id` = '3'
GROUP BY `b`.`id`
ORDER BY `b`.`created_at` DESC