app/Controllers/Accounts/Dashboard.php

    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('accountant')) {
            return redirect()->to(site_url('dashboard'));
        }

        $db = db_connect();

        // Today's date range
        $today = date('Y-m-d');

        // Revenue calculations (from payments) - use COALESCE to handle NULL payment_date
        $todayRevenue = $db->table('payments')
            ->selectSum('amount')
            ->where('DATE(COALESCE(payment_date, created_at))', $today)
            ->where('amount >', 0) // Exclude refunds
            ->get()
            ->getRowArray();
        $todayRevenueAmount = floatval($todayRevenue['amount'] ?? 0);

        $monthRevenue = $db->table('payments')
            ->selectSum('amount')
            ->where('MONTH(COALESCE(payment_date, created_at))', date('n'))
            ->where('YEAR(COALESCE(payment_date, created_at))', date('Y'))
            ->where('amount >', 0)
            ->get()
            ->getRowArray();
        $monthRevenueAmount = floatval($monthRevenue['amount'] ?? 0);

        $yearRevenue = $db->table('payments')
            ->selectSum('amount')
            ->where('YEAR(COALESCE(payment_date, created_at))', date('Y'))
            ->where('amount >', 0)
            ->get()
            ->getRowArray();
        $yearRevenueAmount = floatval($yearRevenue['amount'] ?? 0);

        // Expense calculations
        $todayExpenses = $db->table('expenses')
            ->selectSum('amount')
            ->where('expense_date', $today)
            ->get()
            ->getRowArray();
        $todayExpensesAmount = floatval($todayExpenses['amount'] ?? 0);

        $monthExpenses = $db->table('expenses')
            ->selectSum('amount')
            ->where('MONTH(expense_date)', date('n'))
            ->where('YEAR(expense_date)', date('Y'))
            ->get()
            ->getRowArray();
        $monthExpensesAmount = floatval($monthExpenses['amount'] ?? 0);

        $yearExpenses = $db->table('expenses')
            ->selectSum('amount')
            ->where('YEAR(expense_date)', date('Y'))
            ->get()
            ->getRowArray();
---
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE DATE(COALESCE(payment_date, created_at)) = '2025-12-16'
AND `amount` > 0
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE MONTH(COALESCE(payment_date, created_at)) = '12'
AND YEAR(COALESCE(payment_date, created_at)) = '2025'
AND `amount` > 0
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE YEAR(COALESCE(payment_date, created_at)) = '2025'
AND `amount` > 0
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE `expense_date` = '2025-12-16'
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE MONTH(expense_date) = '12'
AND YEAR(expense_date) = '2025'
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE YEAR(expense_date) = '2025'

        $yearProfit = $yearRevenueAmount - $yearExpensesAmount;

        // Count unpaid bills
        $unpaidBills = $db->table('bills')
            ->where('status', 'pending')
            ->countAllResults(false);

        // Count invoices today
        $invoicesToday = $db->table('bills')
            ->where('DATE(created_at)', $today)
            ->countAllResults(false);

        // Recent transactions (last 10)
        $recentTransactions = $db->table('payments pay')
            ->select('pay.*, b.bill_type,
                CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name,
                COALESCE(pay.payment_date, DATE(pay.created_at)) as display_date')
            ->join('bills b', 'b.id = pay.bill_id', 'left')
            ->join('patients p', 'p.id = b.patient_id', 'left')
            ->orderBy('pay.created_at', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `bills`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `bills`
WHERE DATE(created_at) = '2025-12-16'
SELECT `pay`.*, `b`.`bill_type`, CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name, COALESCE(pay.payment_date, DATE(pay.created_at)) as display_date
FROM `payments` `pay`
LEFT JOIN `bills` `b` ON `b`.`id` = `pay`.`bill_id`
LEFT JOIN `patients` `p` ON `p`.`id` = `b`.`patient_id`
ORDER BY `pay`.`created_at` DESC
 LIMIT 10