app/Controllers/Accounts/Expenses.php

    public function index()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('accountant')) {
            return redirect()->to(site_url('dashboard'));
        }

        $db = db_connect();
        $request = $this->request;

        // Get filter parameters
        $filterPatient = $request->getGet('patient_id') ? (int) $request->getGet('patient_id') : null;
        $filterMonth = $request->getGet('month');
        $filterYear = $request->getGet('year') ?? date('Y');
        $filterType = trim($request->getGet('type') ?? ''); // Pharmacy, Laboratory, Consultation, Procedure, Room & Board

        // Get all patients for filter
        $patients = $db->table('patients p')
            ->select('p.id, CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name')
            ->orderBy('p.last_name', 'ASC')
            ->orderBy('p.first_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `p`.`id`, CONCAT(p.first_name, " ", COALESCE(p.middle_name, ""), " ", p.last_name) as patient_name
FROM `patients` `p`
ORDER BY `p`.`last_name` ASC, `p`.`first_name` ASC

        }

        // Get unique bill types for filter
        $billTypes = $db->table('bills')
            ->select('bill_type')
            ->distinct()
            ->where('bill_type IS NOT NULL')
            ->where('bill_type !=', '')
            ->orderBy('bill_type', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT DISTINCT `bill_type`
FROM `bills`
WHERE `bill_type` IS NOT NULL
AND `bill_type` != ''
ORDER BY `bill_type` ASC