app/Controllers/Accounts/Payments.php

    public function recordPayment()
    {
        $result = $this->requireLogin();
        if ($result !== true) {
            return $result;
        }

        if (!$this->hasRole('accountant')) {
            return redirect()->to(site_url('dashboard'));
        }

        $db = db_connect();
        $request = $this->request;

        $patientId = $request->getPost('patient_id');
        $paymentAmount = floatval($request->getPost('payment_amount'));
        $paymentDate = $request->getPost('payment_date') ?: date('Y-m-d');
        $paymentMethod = trim($request->getPost('payment_method') ?? 'cash');
        $notes = trim($request->getPost('notes') ?? '');

        if (!$patientId || $paymentAmount <= 0) {
            session()->setFlashdata('error', 'Please provide a patient and valid payment amount.');
            return redirect()->to(site_url('accounts/billing'));
        }

        // Get all pending bills for this patient
        $bills = $db->table('bills b')
            ->select('b.*, COALESCE(SUM(pay.amount), 0) as current_paid')
            ->join('payments pay', 'pay.bill_id = b.id', 'left')
            ->where('b.patient_id', $patientId)
            ->groupBy('b.id')
            ->get()
            ->getResultArray();
---
SELECT `b`.*, COALESCE(SUM(pay.amount), 0) as current_paid
FROM `bills` `b`
LEFT JOIN `payments` `pay` ON `pay`.`bill_id` = `b`.`id`
WHERE `b`.`patient_id` = '1'
GROUP BY `b`.`id`


            if ($billPaymentAmount > 0) {
                // Record payment for this bill
                $db->table('payments')->insert([
                    'bill_id' => $bill['id'],
                    'amount' => $billPaymentAmount,
                    'payment_date' => $paymentDate,
                    'payment_method' => $paymentMethod,
                    'created_at' => date('Y-m-d H:i:s'),
                    'updated_at' => date('Y-m-d H:i:s'),
                ]);

                // Calculate new total paid for this bill
                $totalPaid = $db->table('payments')
                    ->selectSum('amount')
                    ->where('bill_id', $bill['id'])
                    ->get()
                    ->getRowArray();
---
INSERT INTO `payments` (`bill_id`, `amount`, `payment_date`, `payment_method`, `created_at`, `updated_at`) VALUES ('10', 75, '2025-12-15', 'cash', '2025-12-15 17:32:07', '2025-12-15 17:32:07')
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `bill_id` = '10'

                // Update bill status
                $newStatus = ($paidTotal >= $bill['total']) ? 'paid' : 'pending';

                $db->table('bills')
                    ->where('id', $bill['id'])
                    ->update([
                        'status' => $newStatus,
                        'updated_at' => date('Y-m-d H:i:s')
                    ]);
---
UPDATE `bills` SET `status` = 'paid', `updated_at` = '2025-12-15 17:32:07'
WHERE `id` = '10'